In [ ]:
import pandas as pd
import numpy as np

In [13]:
dict = {
    "name":['varsha','shivam','divya','sanket'],
    "marks":[78,23,45,16],
    "city":['satara','pune','satara','mumbai']
}

In [14]:
df = pd.DataFrame(dict)

In [15]:
df

     name  marks    city
0  varsha     78  satara
1  shivam     23    pune
2   divya     45  satara
3  sanket     16  mumbai

In [16]:
df.to_csv("demo.csv",index= False)

In [17]:
df.to_csv("demo2.csv",index = False)

In [18]:
df.head(2)

     name  marks    city
0  varsha     78  satara
1  shivam     23    pune

In [19]:
df.tail(3)

     name  marks    city
1  shivam     23    pune
2   divya     45  satara
3  sanket     16  mumbai

In [20]:
df.describe()

           marks
count   4.000000
mean   40.500000
std    27.886675
min    16.000000
25%    21.250000
50%    34.000000
75%    53.250000
max    78.000000

In [21]:
df1 = pd.read_csv('demo2.csv')

In [23]:
df1

     name  marks    city
0  varsha     78  satara
1  shivam     23    pune
2   divya     45  satara
3  sanket     16  mumbai

In [27]:
df1

     name  marks    city
0  varsha     56  satara
1  shivam     23    pune
2   divya     45  satara
3  sanket     16  mumbai

In [28]:
df1.to_csv('demo2.csv',index = False)

In [29]:
df1.name = ['ab','vg','th','ab']

In [30]:
df1

  name  marks    city
0   ab     56  satara
1   vg     23    pune
2   th     45  satara
3   ab     16  mumbai

In [ ]:
ser = pd.Series(np.random.rand(34))

In [ ]:
ser

In [ ]:
ser(type)

In [ ]:
type(ser)

In [ ]:
newdf = pd.DataFrame(np.random.rand(334,5),index = np.arange(334))

In [ ]:
newdf

In [ ]:
type(newdf)

In [ ]:
newdf.describe()

In [ ]:
newdf.dtypes

In [ ]:
newdf[0][0] = "Varsha"

In [ ]:
newdf.dtypes

In [ ]:
newdf.head

In [ ]:
newdf.index

In [ ]:
newdf.columns

In [ ]:
newdf.to_numpy()

In [ ]:
newdf.loc[0,0] = 234

In [ ]:
newdf

In [ ]:
newdf.head()

In [ ]:
newdf.columns = list("ABCDE")

In [ ]:
newdf

In [ ]:
newdf.loc[0,0] = "Varsha"

In [ ]:
newdf

In [ ]:
newdf=newdf.drop(0,axis=1)

In [ ]:
newdf

In [ ]:
dict = {'col1': [1, 2,3], 'col2': [2,5,6]}

In [ ]:
d = pd.DataFrame(data=dict)

In [ ]:
d.describe()

In [ ]:
d = d.set_index(['col1', 'col2'])

In [ ]:
d

In [ ]:
s = pd.Series([4,5,6], name='col2')

In [ ]:
s

In [ ]:
s.min()

In [ ]:
s.max()

In [ ]:
s.count()

In [ ]:
s.mean()

In [ ]:
s.median()

In [ ]:
s.std()

In [ ]:
d.corr()

In [ ]:
d.to_csv('out.csv', index=False)

In [ ]:
pd.read_csv('out.csv')